Revit 2015 API
ExternalDefinitonCreationOptions.GUID Property
 The GUID to use for this parameter definition. If not explicitly set, a random GUID is used.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public Guid GUID { get; set; }
Visual Basic
Public Property GUID As Guid
	Get
	Set
Visual C++
public:
property Guid GUID {
	Guid get ();
	void set (Guid value);
}
See Also
ExternalDefinitonCreationOptions Class
Autodesk.Revit.DB Namespace